.doom.d/config.org
* Apperance
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Iosevka" :weight 'regular :size 16)
      doom-theme 'doom-sourcerer)
#+end_src
* Indentation
#+begin_src emacs-lisp
(setq  standard-indent 2)
#+end_src

* Cursor behaviour and movement
#+begin_src emacs-lisp
(setq evil-move-cursor-back nil)
#+end_src

This next bit is commented out as I'm mostly using GUI. Don't want to forget this in case I go back to termianal emacs. As the name suggest, it will change the way the cursor looks per mode in the teminal.

#+BEGIN_SRC elisp
;; (unless (display-graphic-p)
;;     (require 'evil-terminal-cursor-changer)
;;     (evil-terminal-cursor-changer-activate)
;;   )
#+END_SRC

* Line numbers, fringe indicators, etc...

#+begin_src emacs-lisp
(setq display-line-numbers-type nil
      scroll-margin 8
      )
#+end_src

* ORG Mode
#+BEGIN_SRC elisp
(after! org
  (setq org-startup-folded t
   org-modules '(ol-bibtex org-habit)
   org-directory "~/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/org"
   org-default-notes-file (concat org-directory "/notes.org")
   org-agenda-files (file-expand-wildcards org-directory)
   )
)
#+END_SRC

* Move between windows
#+BEGIN_SRC elisp
(global-set-key (kbd "C-h") 'evil-window-left)
(global-set-key (kbd "C-j") 'evil-window-down)
(global-set-key (kbd "C-k") 'evil-window-up)
(global-set-key (kbd "C-l") 'evil-window-right)
#+END_SRC

* Move between visual lines
#+begin_src emacs-lisp
(define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(setq-default evil-cross-lines t)
#+end_src

* Start with the window maximised
#+begin_src emacs-lisp
(custom-set-variables
 '(initial-frame-alist (quote ((fullscreen . maximized)))))
#+end_src

* Mode Settings
* Hooks
#+begin_src emacs-lisp
(add-hook 'web-mode-hook 'prettier-js-mode (lsp))
#+end_src
* LSP
#+begin_src emacs-lisp
#+end_src
* What the key
#+begin_src emacs-lisp
(map! :leader
      :desc "Just save everything" "j" #'evil-write-all)
#+end_src
